{
	"traductions": {
		"nav_home": {
			"fr":"Accueil",
			"en":"Home"
		},
        "nav_about": {
			"fr":"À propos",
			"en":"About me"
		},
        "nav_education": {
			"fr":"Études",
			"en":"Education"
		},
        "nav_certificates": {
			"fr":"Certifications",
			"en":"Certificates"
		},
        "nav_experiences": {
			"fr":"Expériences",
			"en":"Experiences"
		},
        "nav_skills": {
			"fr":"Compétences",
			"en":"Skills"
		},
        "nav_projects": {
			"fr":"Projets",
			"en":"Projects"
		},
        "nav_hobbies": {
			"fr":"Centres d'intérêt",
			"en":"Hobbies"
		},
        "nav_videos": {
			"fr":"Vidéos",
			"en":"Videos"
		},
        "mail_link": {
			"fr":"<a href=\"mailto:renaldmorice@hotmail.fr\" title=\"Envoyer un email\"><i class=\"fas fa-envelope\"></i></a>",
			"en":"<a href=\"mailto:renaldmorice@hotmail.fr\" title=\"Send an email\"><i class=\"fas fa-envelope\"></i></a>"
		},
        "linkedin_link": {
			"fr":"<a target=\"_blank\" href=\"https://www.linkedin.com/in/renaldmorice\" title=\"Profil LinkedIn\"><i class=\"fab fa-linkedin\"></i></a>",
			"en":"<a target=\"_blank\" href=\"https://www.linkedin.com/in/renaldmorice\" title=\"LinkedIn profile\"><i class=\"fab fa-linkedin\"></i></a>"
		},
        "github_link": {
			"fr":"<a target=\"_blank\" href=\"https://github.com/renald-morice\" title=\"Profil GitHub\"><i class=\"fab fa-github\"></i></a>",
			"en":"<a target=\"_blank\" href=\"https://github.com/renald-morice\" title=\"GitHub profile\"><i class=\"fab fa-github\"></i></a>"
		},
        "youtube_link": {
			"fr":"<a target=\"_blank\" href=\"https://www.youtube.com/channel/UCn-8sTlU69pFRyvRFTYO7tg\" title=\"Chaîne Youtube\"><i class=\"fab fa-youtube-square\"></i></a>",
			"en":"<a target=\"_blank\" href=\"https://www.youtube.com/channel/UCn-8sTlU69pFRyvRFTYO7tg\" title=\"Youtube channel\"><i class=\"fab fa-youtube-square\"></i></a>"
		},
        "status": {
			"fr":"Développeur stagiaire chez Coveo",
			"en":"Software Developer Intern at Coveo"
		},
        "status2": {
			"fr":"Amateur de musiques de films - Expert de l'inattendu",
			"en":"Movie soundtracks enthusiast - Expert of the unexpected"
		},
        "CV": {
			"fr":"<a class=\"animated\" target=\"_blank\" href=\"CV-RenaldMorice.pdf\">CV</a>",
			"en":"<a class=\"animated\" target=\"_blank\" href=\"Resume-RenaldMorice.pdf\">Resume</a>"
		},
        "about": {
			"fr":"À propos",
			"en":"About me"
		},
        "about_p1": {
			"fr":"Cette année, je termine mon double diplôme en informatique par le biais d'un stage (<span class=\"text_link scrollTo\" data-scrollTo=\"#studies\">cliquez ici</span> pour plus de détails). Être développeur chez Coveo est pour moi une excellente occasion de découvrir les technologies du Cloud et les défis associés (disponibilité, évolutivité, sécurité, impact sur les coûts, etc.), ainsi que les méthodes de travail efficaces d'une entreprise qui se développe continuellement à une vitesse incroyable! <span class=\"text_link scrollTo\" data-scrollTo=\"#work_experiences\">Cliquez ici</span> pour plus d'informations.",
			"en":"This year, I am finishing my dual degree in computer science by doing an internship (<span class=\"text_link scrollTo\" data-scrollTo=\"#studies\">click here</span> for more details). Being a developer at Coveo is a great opportunity for me to discover Cloud technologies and related challenges (availabality, scaling, security, cost impact, etc.), as well as effective work methods in a company that grows continually at incredible speed! <span class=\"text_link scrollTo\" data-scrollTo=\"#work_experiences\">Click here</span> for more information."
		},
        "about_p2": {
			"fr":"Les secteurs d'activité qui me passionnent sont nombreux. Je suis polyvalent et j'aime pouvoir expérimenter de nouvelles choses, c’est pourquoi je reste très <b>ouvert d’esprit</b> quant aux missions auxquelles je pourrais être amené à contribuer. N'hésitez pas à me contacter pour parler de projet!",
			"en":"Business sectors that fascinate me are numerous. I am versatile and I like to discover new things, that is why I remain very <b>open-minded</b> about the missions to which I could possibly contribute. Feel free to contact me to talk about project!"
		},
        "about_sectors": {
			"fr":"Les domaines métiers en lien avec le divertissement m’attirent beaucoup :",
			"en":"Business sectors related to entertainment attract me a lot:"
		},
        "about_sectors_1": {
			"fr":"Musique",
			"en":"Music"
		},
        "about_sectors_2": {
			"fr":"Jeu vidéo",
			"en":"Video game"
		},
        "about_sectors_3": {
			"fr":"Cinéma",
			"en":"Cinema"
		},
        "about_sectors_4": {
			"fr":"Audiovisuel",
			"en":"Audiovisual"
		},
        "about_sectors_5": {
			"fr":"Spectacle",
			"en":"Show"
		},
        "about_sectors_6": {
			"fr":"Etc...",
			"en":"Etc."
		},
        "about_missions": {
			"fr":"Voici 6 exemples de sujets qui attisent ma curiosité :",
			"en":"Here are 6 examples of subjects that arouse my curiosity:"
		},
        "about_missions_1": {
			"fr":"L’audio",
			"en":"Audio"
		},
        "about_missions_2": {
			"fr":"La vidéo",
			"en":"Video"
		},
        "about_missions_3": {
			"fr":"La programmation 3D",
			"en":"3D programming"
		},
        "about_missions_4": {
			"fr":"L’Intelligence artificielle",
			"en":"Artifical Intelligence"
		},
        "about_missions_5": {
			"fr":"Le développement logiciel",
			"en":"Software development"
		},
        "about_missions_6": {
			"fr":"Le Big Data",
			"en":"Big Data"
		},
        "about_missions_7": {
			"fr":"Le Natural Language Processing",
			"en":"Natural Language Processing"
		},
        "education_t1": {
			"fr":"Études",
			"en":"Education"
		},
        "education_t2": {
			"fr":"Double diplôme",
			"en":"Dual degree"
		},
        "education_U": {
            "fr":"Maîtrise en informatique (option jeux vidéo) à l'Université du Québec à Chicoutimi",
			"en":"Master in Computer Science (video game option) at Université du Québec à Chicoutimi"
        },
        "education_U_dates": {
            "fr":"Septembre 2017 - Juin 2018",
			"en":"September 2017 - Juny 2018"
        },
        "education_U_desc": {
            "fr":"J’effectue une <a class=\"text_link\" href=\"https://www.uqac.ca/programme/1537-maitrise-en-informatique-jeux-video\" target=\"_blank\">maîtrise en informatique (option jeux vidéo)</a> à l’UQAC. Je suis intéressé par les domaines métiers liés au divertissement (dont le jeu vidéo), mais j'aime également acquérir de nouvelles connaissances dans d'autres domaines. C'est la raison pour laquelle j'apprécie réaliser cette maîtrise car je participe à des cours concernant l'industrie du jeu vidéo et à des cours d'informatique plus conventionnels.",
			"en":"I am doing a <a class=\"text_link\" href=\"https://www.uqac.ca/programme/1537-maitrise-en-informatique-jeux-video\" target=\"_blank\">master’s degree in computer science (video game option)</a> in this university. All business fields related to entertainment (including video games) are attracting me a lot, but I also like to develop new skills in other fields. That's why I really enjoy doing this master because I can follow courses in relation with the video game industry and more classical computer courses."
        },
        "education_U_VG": {
            "fr":"Cours informatiques suivis en lien avec l'industrie du jeu vidéo :",
			"en":"Followed courses in relation with the video game industry:"
        },
        "education_U_VG_1": {
            "fr":"Principes de création de jeux vidéo",
			"en":"Design and development of video games"
        },
        "education_U_VG_2": {
            "fr":"Intelligence artificielle pour le jeu vidéo",
			"en":" Artificial intelligence for video games"
        },
        "education_U_VG_3": {
            "fr":"Principes des moteurs jeux",
			"en":"Principles of game engines"
        },
        "education_U_O": {
            "fr":"Autres cours informatiques suivis :",
			"en":"Other followed computer courses:"
        },
        "education_U_O_1": {
            "fr":"Gestion de projets informatiques",
			"en":"IT project management"
        },
        "education_U_O_2": {
            "fr":"Génie logiciel",
			"en":"Software engineering"
        },
        "education_U_O_3": {
            "fr":"Programmation objet avancée",
			"en":"Advanced Object Oriented Programming"
        },
        "education_U_O_4": {
            "fr":"Bases de données réparties",
			"en":"Distributed databases"
        },
        "education_U_O_5": {
            "fr":"Forage de données",
			"en":"Data mining"
        },
        "education_U_O_6": {
            "fr":"Systèmes intégrés de gestion d'entreprise (ERP)",
			"en":"Enterprise Resource Planning (ERP)"
        },
        "education_U_O_7": {
            "fr":"Cybersécurité et Analyse Forensique",
			"en":"Cybersecurity and Forensic Analysis"
        },
        "education_I": {
            "fr":"École d'ingénieurs des Hautes Technologies et du Numérique",
			"en":"ISEN Engineering School"
        },
        "education_I_dates": {
            "fr":"Septembre 2013 - Juin 2018",
			"en":"September 2013 - Juny 2018"
        },
        "education_I_desc": {
            "fr":"Pour mes trois premières années à l’ISEN Brest, j’ai choisi d’intégrer la <a class=\"text_link\" href=\"https://isen-brest.fr/formation-ingenieur/ingenieur-informatique/\" target=\"_blank\">filière CIR</a> (Cycle Informatique et Réseaux) qui permet immédiatement d’acquérir de solides compétences en informatique sans négliger l’apprentissage des sciences. Cette filière m'a également permis d'avoir une première expérience dans le domaine de l'informatique en réalisant un stage de 2 mois et une alternance d'un an chez Salamander Soft.",
			"en":"For my first three years at ISEN Brest, I chose to integrate the <a class=\"text_link\" href=\"https://isen-brest.fr/formation-ingenieur/ingenieur-informatique/\" target=\"_blank\">CIR Program</a> (“Cycle Informatique et Réseaux” which means “Computer Science and Networks Program”). I have immediately acquired solid computer skills without neglecting basic science learning (such as math, physics, etc.). This program also gave me the opportunity to have a first professional computer experience by completing a two-month internship and an one-year part-time internship at Salamander Soft."
        },
        "education_I_desc2": {
            "fr":"L'ISEN est partenaire avec l’UQAC. Pour la deuxième année de Master et dernière année, L'ISEN propose à ses étudiants de partir à Chicoutimi (Canada) pour réaliser un double diplôme à l'international, ce que j’ai décidé de faire !",
			"en":"ISEN is a partner of UQAC. For the fifth and last year, ISEN proposes its students to go to Chicoutimi (Canada) to do a dual degree abroad, which I decided to do!"
        },
        "certificate": {
            "fr":"Certifications",
			"en":"Certificates"
        },
        "certificate_show": {
            "fr":"Visualiser le certificat",
			"en":"See certificate"
        },
        "certificate_FCE_desc": {
            "fr":"Examen international certifiant un bon niveau d'anglais (capacité à évoluer dans un environnement anglophone sans être bilingue).",
			"en":"International exam certifying good English skills (ability to evolve in an English-speaking environment)."
        },
        "certificate_V_desc": {
            "fr":"Certificat permet de valider une bonne maîtrise de langue française à l'écrit (voir le certificat pour connaître les caractéristiques du barème).",
			"en":"French exam certifying good French skills (see the certificate for the scale’s details)."
        },
        "exp": {
            "fr":"Expériences",
			"en":"Experiences"
        },
        "exp_coveo": {
            "fr":"Développeur logiciel",
			"en":"Software developer"
        },
        "exp_coveo_contract": {
            "fr":"Stage",
			"en":"Internship"
        },
        "exp_coveo_dates": {
            "fr":"Septembre 2018 - Mars 2019",
			"en":"September 2018 - March 2019"
        },
        "exp_coveo_desc": {
            "fr":"Coveo propose aux entreprises un moteur de recherche (et de recommandation) personnalisé à leurs besoins. L’objectif est de dynamiser l’expérience de leurs clients, partenaires, revendeurs et employés. Créée en 2005 et originaire de la ville de Québec, Coveo est passé d’une petite entreprise à une entreprise aux dimensions internationales, maintenant installée dans cinq villes (Québec, Montréal, San Francisco, Amsterdam et Londres).",
			"en":"Coveo offers companies a search (and recommendation)  engine  customized to their needs. The goal is to enhance the experience of their customers, partners, dealers, and employees. Originally  established in Quebec City in 2005, Coveo has grown from a small business to an international company and is now based in five cities (Quebec City, Montreal, San Francisco, Amsterdam and London)."
        },
        "exp_coveo_desc2": {
            "fr":"La <a class=\"text_link\" href=\"https://docs.coveo.com/en/143/cloud-v2-developers/coveo-cloud-v2-api-overview\" target=\"_blank\">plate-forme Coveo Cloud V2</a> est propulsée par de l’intelligence artificielle et basée sur le Cloud. Afin de couvrir le plus possible l’ensemble des données d’une entreprise, la plate-forme offre déjà plus d’une trentaine de connecteurs prédéfinis qui permettent d'indexer, en toute sécurité, le contenu de l’entreprise provenant de plusieurs types de source (<a class=\"text_link\" href=\"https://docs.coveo.com/en/1997/cloud-v2-administrators/available-coveo-cloud-v2-source-types\" target=\"_blank\">voir la liste ici</a>).",
			"en":"The <a class=\"text_link\" href=\"https://docs.coveo.com/en/143/cloud-v2-developers/coveo-cloud-v2-api-overview\" target=\"_blank\">Coveo Cloud V2 platform</a> is cloud-based and powered by artificial intelligence. In order to cover as much as possible all the data of one given company, the platform already offers more than thirty predefined connectors allowing to securely index the content of the company coming from several source types (<a class=\"text_link\" href=\"https://docs.coveo.com/en/1997/cloud-v2-administrators/available-coveo-cloud-v2-source-types\" target=\"_blank\">see the list here</a>)."
        },
        "exp_coveo_duty": {
            "fr":"Je travaille actuellement dans l’équipe \"Source\" qui a deux grandes responsabilités : la gestion de la couche back-end des sources ainsi que la gestion du <a class=\"text_link\" href=\"https://docs.coveo.com/en/78/cloud-v2-developers/push-api-reference\" target=\"_blank\">Push API</a>. En tant que développeur, je contribue à l’élaboration de nouvelles fonctionnalités, la correction d'anomalies, la mise en place de tests automatisés, ou encore le développement d’une infrastructure \"as-code\". La revue de code fait partie du quotidien, tout comme la collaboration entre les équipes.",
			"en":"I am currently working in the \"Source\" team, which has two main responsibilities: the management of the source back-end layer and the management of the <a class=\"text_link\" href=\"https://docs.coveo.com/en/78/cloud-v2-developers/push-api-reference\" target=\"_blank\">Push API</a>. As a developer, I contribute to the development of new functionalities, the correction of anomalies, the creation of automated tests, or the management of an infrastructure \"as-code\". Code review is part of daily life, as well as communication between teams."
        },
        "exp_coveo_skills": {
            "fr":"Compétences nécessaires :",
			"en":"Skills required:"
        },
        "exp_coveo_skills_list": {
            "fr":"Java, Spring Framework, Maven, Python, Docker, Kubernetes, Amazon Web Services (AWS), Terraform, Méthodologie Scrum",
			"en":"Java, Spring Framework, Maven, Python, Docker, Kubernetes, Amazon Web Services (AWS), Terraform, Scrum Method"
        }, 
        "exp_sal": {
            "fr":"Développeur logiciel",
			"en":"Software developer"
        },
        "exp_sal_soc": {
            "fr":"Salamander, filiale d'Alcyon SI",
			"en":"Salamander, subsidiary of Alcyon SI"
        },
        "exp_sal_contract": {
            "fr":"Stage &amp; alternance",
			"en":"Internship &amp; part-time internship"
        },
        "exp_sal_dates": {
            "fr":"Juillet 2015 - Septembre 2016",
			"en":"July 2015 - September 2016"
        },
        "exp_sal_desc": {
            "fr":"Salamander est une entreprise qui édite un logiciel nommé « S@M » destiné aux sociétés de gestion de portefeuilles qui ont pour mission d'obtenir le meilleur rendement possible pour leurs comptes clients. S@M permet d’accompagner un gestionnaire de portefeuille dans son travail au quotidien (pilotage de portefeuilles, optimisation des performances, gestion du risque, amélioration de la relation client, etc...).",
			"en":"Salamander develops a software named “S@M” for portfolio management companies whose mission is to get the best possible performance on their customer accounts. S@M is helping a portfolio management company in its daily work (portfolio management, performance optimization, risk management, customer relationship improvement, etc.)."
        },
        "exp_sal_i": {
            "fr":"Durant mon stage, j'ai eu pour mission de :",
			"en":"During my 2-month internship, my missions were to:"
        },
        "exp_sal_i1": {
            "fr":"rédiger une documentation utilisateur S@M disponible en ligne",
			"en":"write “S@M” user documentation available online"
        },
        "exp_sal_i2": {
            "fr":"créer une page synthétisant les importations fournisseurs",
			"en":"create a new page summarizing supplier imports"
        },
        "exp_sal_i3": {
            "fr":"proposer une page afin de réaliser plusieurs ordres ou opérations à la fois",
			"en":"develop a new page allowing a manager to create new orders and operations massively"
        },
        "exp_sal_pti": {
            "fr":"Durant mon alternance, j'ai eu pour mission de :",
			"en":"During my one-year part-time internship, my missions were to:"
        },
        "exp_sal_pti1": {
            "fr":"créer un module S@M destiné à la gestion du risque avec implémentation d'indicateurs financiers",
			"en":"design a new S@M module of risk management allowing a manager to automate financial risk controls"
        },
        "exp_sal_pti2": {
            "fr":"créer un nouveau dashboard permettant de synthétiser l'état d'un environnement client",
			"en":"create a new dashboard to summarize the state of a customer environment"
        },
        "exp_sal_pti3": {
            "fr":"développer un site vitrine pour Salamander à l'aide de la technologie Drupal",
			"en":"develop a showcase website for Salamander using Drupal technology"
        },
        "exp_sal_skills": {
            "fr":"Compétences nécessaires :",
			"en":"Skills required :"
        },
        "exp_sal_skills_list": {
            "fr":"Oracle Database, Oracle APEX, PL/SQL, Script Shell, Technologies web standards (HTML/CSS/JS/PHP), Drupal (CMS), Dokuwiki",
			"en":"Oracle Database, Oracle APEX, PL/SQL, Script Shell, standards web technologies (HTML/CSS/JS/PHP), Drupal (CMS), Dokuwiki"
        },
        "exp_conf": {
            "fr":"Préparateur de commande",
			"en":"Order picker"
        },
        "exp_conf_contract": {
            "fr":"Emploi saisonnier",
			"en":"Summer job"
        },
        "exp_conf_dates": {
            "fr":"Juillet - Août 2013 &amp; 2014",
			"en":"July - August 2013 &amp; 2014"
        },
        "exp_fg": {
            "fr":"Ouvrier dans une exploitation céréalière",
			"en":"Worker on a grain farm"
        },
        "exp_fg_comp": {
            "fr":"Ferme de la Godine",
			"en":"“Ferme de la Godine”"
        },
        "exp_fg_contract": {
            "fr":"Emploi saisonnier",
			"en":"Summer job"
        },
        "exp_fg_dates": {
            "fr":"Août 2012",
			"en":"August 2012"
        },
        "exp_earl": {
            "fr":"Entreprise familiale (exploitation avicole)",
			"en":"Family business (poultry farm)"
        },
        "exp_earl_comp": {
            "fr":"EARL de l'Hippodrome",
			"en":"“EARL de l'Hippodrome”"
        },
        "exp_earl_contract": {
            "fr":"Pas de statut",
			"en":"No status"
        },
        "exp_earl_dates": {
            "fr":"Depuis plusieurs années",
			"en":"Since many years"
        },
        "skill": {
            "fr":"Compétences",
			"en":"Skills"
        },
        "skill_SD": {
            "fr":"Programmation",
			"en":"Software development"
        },
        "skill_WT": {
            "fr":"Technologies Web",
			"en":"Web technologies"
        },
        "skill_DB": {
            "fr":"Base de données",
			"en":"Databases"
        },
        "skill_OS": {
            "fr":"Systèmes d’exploitation",
			"en":"Operating systems"
        },
        "skill_GE": {
            "fr":"Moteur de jeu",
			"en":"Game engine"
        },
        "skill_AE": {
            "fr":"Moteur audio",
			"en":"Audio engine"
        },
        "skill_FMOD": {
            "fr":"FMOD (notions)",
			"en":"FMOD (bases)"
        },
        "skill_AR": {
            "fr":"Enregistrement audio",
			"en":"Audio recording"
        },
        "skill_PV": {
            "fr":"Photo / Vidéo",
			"en":"Photo / Video"
        },
        "skill_PM": {
            "fr":"Gestion de projet",
			"en":"Project management"
        },
        "skill_SCRUM": {
            "fr":"Méthode Scrum",
			"en":"Scrum method"
        },
        "skill_L": {
            "fr":"Langues",
			"en":"Languages"
        },
        "skill_fr": {
            "fr":"Français",
			"en":"French"
        },
        "skill_en": {
            "fr":"Anglais",
			"en":"English"
        },
        "skill_CT": {
            "fr":"Technologies Cloud",
			"en":"Cloud technologies"
        },
        "skill_CSO": {
            "fr":"Informatique (autre)",
			"en":"Computer science (other)"
        },
        "projects": {
            "fr":"Projets",
			"en":"Projects"
        },
        "projects_LIDW": {
            "fr":"« Lost In DinoWorld » - Jeu 2D Android",
			"en":"“Lost In DinoWorld” - 2D Android game"
        },
        "projects_more": {
            "fr":"En savoir plus",
			"en":"More details"
        },
        "projects_GameEngine": {
            "fr":"Création d’un moteur de jeu",
			"en":"Game engine development"
        },
        "projects_Raven": {
            "fr":"« Raven » - Jeu de tir entre des robots intelligents",
			"en":"“Raven” - Shooter game between bots with IA"
        },
        "projects_AM": {
            "fr":"« Monitoring d’activité »",
			"en":"“Activity monitoring”"
        },
        "projects_CC": {
            "fr":"Projet de cluster computing",
			"en":"Cluster computing project"
        },
        "projects_RE": {
            "fr":"Robot extincteur",
			"en":"Fire extinguisher robot"
        },
        "projects_LIPS": {
            "fr":"« LIPS » - Application pour personnes âgées",
			"en":"“LIPS” - Application for elderly people"
        },
        "projects_FOA": {
            "fr":"Forum Ouest Avenir",
			"en":"Forum Ouest Avenir"
        },
        "hobbies": {
            "fr":"Centres d'intérêt",
			"en":"Hobbies"
        },
        "hobbies_music": {
            "fr":"Musique<br>(pratique du piano)",
			"en":"Music<br>(play the piano)"
        },
        "hobbies_film": {
            "fr":"Films<br>Séries TV",
			"en":"Movies<br>TV series"
        },
        "hobbies_vg": {
            "fr":"Jeux vidéo",
			"en":"Video games"
        },
        "hobbies_dev": {
            "fr":"Programmation<br>informatique",
			"en":"Computer<br>programming"
        },
        "hobbies_ar": {
            "fr":"Enregistrement<br>audio",
			"en":"Audio<br>recording"
        },
        "hobbies_ve": {
            "fr":"Montage<br>vidéo",
			"en":"Video<br>editing"
        },
        "hobbies_squash": {
            "fr":"Squash",
			"en":"Squash"
        },
        "hobbies_ski": {
            "fr":"Ski",
			"en":"Ski"
        },
        "hobbies_go": {
            "fr":"Sortir",
			"en":"Go out"
        },
        "hobbies_travel": {
            "fr":"Voyage",
			"en":"Travel"
        },
        "hobbies_show": {
            "fr":"Spectacles",
			"en":"Shows"
        },
        "hobbies_science": {
            "fr":"Sciences",
			"en":"Sciences"
        },
        "videos": {
            "fr":"Vidéos",
			"en":"Videos"
        },
        "footer_creator": {
            "fr":"Site réalisé par Rénald Morice",
			"en":"Website created by Rénald Morice"
        },
        "footer_host": {
            "fr":"Site hébergé chez <a class=\"text_link\" href=\"https://www.ovh.com/ca/fr/\" title=\"OVH Canada\" target=\"_blank\">OVH Canada</a>",
			"en":"Website hosted by <a class=\"text_link\" href=\"https://www.ovh.com/ca/fr/\" title=\"OVH Canada\" target=\"_blank\">OVH Canada</a>"
        },
        "footer_icons": {
            "fr":"Icônes provenant de <a class=\"text_link\" href=\"https://www.flaticon.com/\" title=\"Flaticon\" target=\"_blank\">www.flaticon.com</a> & <a class=\"text_link\" href=\"https://www.fontawesome.com/\" title=\"Font Awesome\" target=\"_blank\">www.fontawesome.com</a>",
			"en":"Icons from <a class=\"text_link\" href=\"https://www.flaticon.com/\" title=\"Flaticon\" target=\"_blank\">www.flaticon.com</a> & <a class=\"text_link\" href=\"https://www.fontawesome.com/\" title=\"Font Awesome\" target=\"_blank\">www.fontawesome.com</a>"
        },
        "project_details_skills": {
            "fr":"Compétences nécessaires",
			"en":"Skills required"
        },
        "project_details_rapport": {
            "fr":"Rapport de projet",
			"en":"Project report"
        },
        "project_details_slides": {
            "fr":"Slides de présentation",
			"en":"Presentation's slides"
        },
        "LIDW": {
            "fr":"« Lost In DinoWorld » - Jeu 2D Android",
			"en":"“Lost In DinoWorld” - 2D Android game"
        },
        "LIDW_context": {
            "fr":"Projet de 4 étudiants réalisé dans le cadre du cours « Principes de création de jeux vidéo » - UQAC automne 2017",
			"en":"A 4-student project in relation with the “Principles of creating video games” course - UQAC fall 2017"
        },
        "LIDW_genre": {
            "fr":"« Lost In DinoWord » est un jeu 2D coloré à l’ambiance cartoon qui se classe parmi les 4 genres suivants :",
			"en":"“Lost In DinoWord” is a colorful 2D game that ranks among the following 4 kind of video games:"
        },
        "LIDW_genre1": {
            "fr":"Jeu d’aventure",
			"en":"Adventure game"
        },
        "LIDW_genre2": {
            "fr":"Jeu de combat",
			"en":"Fighting game"
        },
        "LIDW_genre3": {
            "fr":"Jeu de plateforme",
			"en":"Platform game"
        },
        "LIDW_genre4": {
            "fr":"Side scrolling (jeu à défilement horizontal)",
			"en":"Side scrolling (horizontal scrolling game)"
        },
        "LIDW_synopsis": {
            "fr":"Un scientifique souhaite éradiquer le virus qui ravage la population humaine en 2150. Il est parvenu à trouver la formule de l’antidote. Le problème ? Les ingrédients nécessaires à cette formule n’existent qu’à l’époque des dinosaures ! Il décide alors de voyager dans le temps.",
			"en":"A scientist wants to eradicate the virus that ravages the human population in 2150. He already managed to find out the antidote formula. The problem? All necessary ingredients for this formula only exist at the time of the dinosaurs! That is why he decides to travel back in time."
        },
        "LIDW_game": {
            "fr":"Jeu",
			"en":"Game"
        },
        "LIDW_game_desc": {
            "fr":"Le joueur, qui incarne le scientifique nouvellement arrivé à l’époque des dinosaures, va devoir parcourir un ensemble de six régions pour récolter les ingrédients tant convoités. Il pourra revenir en 2150 grâce au téléporteur présent à la sixième région. Malheureusement pour lui, des dinosaures peu dociles ainsi que des obstacles ralentiront sa course.",
			"en":"The player, who takes control of the newly arrived scientist at the time of the dinosaurs, will have to travel through a set of six regions to collect all the desired ingredients. He will be able to return in 2150 thanks to the teleporter available in the sixth region. Unfortunately for him, some dinosaurs and obstacles will slow down his race."
        },
        "GameEngine": {
            "fr":"Création d’un moteur de jeu",
			"en":"Game engine development"
        },
        "GameEngine_context": {
            "fr":"Projet de 5 étudiants réalisé dans le cadre du cours « Principes des moteurs jeux » - UQAC Automne 2017",
			"en":"A 5-student project in relation with the “Principles of game engines” course - UQAC fall 2017"
        },
        "GameEngine_desc": {
            "fr":"L’objectif final de ce cours était la création d’un moteur de jeu en groupe afin de s’initier aux problématiques de leur conception et développement. Une des contraintes du projet était l’implémentation de l’architecture  « Entité-Composant-Système », très utilisée de nos jours (architecture adoptée par Unity 3D par exemple).",
			"en":"The final goal of this course was the development of a new game engine to better understand the issues related to their design. One of the constraints was to set up the “Entity-Component-System” architecture, widely used today (architecture adopted by Unity 3D for example)."
        },
        "GameEngine_skill1": {
            "fr":"Architecture Entité-Composant-Système",
			"en":"Entity-Component-System Architecture"
        },
        "GameEngine_skill2": {
            "fr":"OpenTK (wrapper C# pour OpenGL, OpenGL ES et OpenAL)",
			"en":"OpenTK (C# wrapper for OpenGL, OpenGL ES and OpenAL)"
        },
        "GameEngine_skill3": {
            "fr":"Moteur audio FMOD",
			"en":"FMOD audio engine"
        },
        "GameEngine_skill4": {
            "fr":"Json.Net pour la sérialisation des données",
			"en":"Json.Net for data serialization"
        },
        "GameEngine_sys": {
            "fr":"Ce moteur comprend :",
			"en":"This engine includes:"
        },
        "GameEngine_sys1": {
            "fr":"Un système de logique",
			"en":"A logic system"
        },
        "GameEngine_sys2": {
            "fr":"Un système de rendu",
			"en":"A rendering system"
        },
        "GameEngine_sys3": {
            "fr":"Un système de physique",
			"en":"A physics system"
        },
        "GameEngine_sys4": {
            "fr":"Un système de gestion des entrées/sorties",
			"en":"An I/O management system"
        },
        "GameEngine_sys5": {
            "fr":"Un système audio",
			"en":"An audio système"
        },
        "Raven": {
            "fr":"« Raven » - Jeu de tir entre des robots intelligents",
			"en":"“Raven” - Shooter game between bots with IA"
        },
        "Raven_context": {
            "fr":"Projet de 5 étudiants réalisé dans le cadre du cours « Intelligence artificielle pour le jeu vidéo » - UQAC automne 2017",
			"en":"A 5-student project in relation with the “Artificial intelligence for video game” course - UQAC fall 2017"
        },
        "Raven_skill1": {
            "fr":"Techniques d'IA",
			"en":"AI techniques"
        },
        "Raven_desc": {
            "fr":"« Raven » est un jeu où des robots intelligents qui s’affrontent en adoptant un comportement le plus humain possible :",
			"en":"“Raven” is a game where intelligent bots confront each other by adopting the most human behavior possible:"
        },
        "Raven_hum1": {
            "fr":"Déplacement stratégique sur le terrain de jeu",
			"en":"Strategic movements on the playing field"
        },
        "Raven_hum2": {
            "fr":"Récupération d’armes et de vie au besoin",
			"en":"Search for weapons and life if necessary"
        },
        "Raven_hum3": {
            "fr":"Tir « humain » (temps de réaction, imprécision, etc…)",
			"en":"“Human” shooting (reaction time, accuracy, etc.)"
        },
        "Raven_goal": {
            "fr":"À partir du code source « Raven » du livre « <a class=\"text_link\" href=\"http://www.jblearning.com/Catalog/9781556220784/student/\" target=\"_blank\">Programming Game AI by Example</a> » de Mat Buckland, l’objectif de ce projet était d’améliorer l’intelligence artificielle des robots. Voici ce que nous avons ajouté :",
			"en":"From the Raven source code of Mat Buckland's “<a class=\"text_link\" href=\"http://www.jblearning.com/Catalog/9781556220784/student/\" target=\"_blank\">Programming Game AI by Example</a>” book, the goal of this project was to improve the artificial intelligence of bots. Here's what we added:"
        },
        "Raven_goal1": {
            "fr":"Comportement dirigé par les buts pour tendre vers un raisonnement humain dans la sélection d’objectifs",
			"en":"Goal-driven behavior to simulate human reasoning in goal selection"
        },
        "Raven_goal2": {
            "fr":"Logique floue permettant au robot de manipuler facilement plusieurs variables et leur degré de certitude afin de prendre une décision",
			"en":"Fuzzy logic allowing the bot to easily manipulate multiple variables and their degree of certainty in order to make suitable decision"
        },
        "Raven_goal3": {
            "fr":"Réseau de neurones (perceptron mono-couche) pour permettre à un robot d’apprendre le comportement stratégique d’un robot contrôlé par un humain",
			"en":"Neural network (single-layer perceptron) to enable a bot to learn a human-based strategy behavior"
        },
        "Raven_goal4": {
            "fr":"Amélioration des techniques de Steering Behaviors (stratégies de déplacement des robots)",
			"en":"Improvement of Steering Behaviors techniques (bots moving strategies)"
        },
        "Raven_goal5": {
            "fr":"Possibilité de créer des équipes de robots avec un leader sélectionnant la cible pour l’ensemble de son équipe",
			"en":"Possibility to create bot teams with a leader selecting a target for his entire team"
        },
        "CC": {
            "fr":"Projet de cluster computing",
			"en":"Cluster computing project"
        },
        "CC_context": {
            "fr":"Projet de 4 étudiants réalisé dans le cadre du cours « Bases de données réparties » - UQAC hiver 2018",
			"en":"A 4-student project in relation with the “Distributed databases” course - UQAC winter 2018"
        },
        "CC_goal": {
            "fr":"Objectifs",
			"en":"Objectives"
        },
        "CC_goal_desc": {
            "fr":"L’objectif principal de ce projet était de se familiariser avec les technologies Apache Spark et GraphX tout en utilisant le langage Scala. Apache Spark est un moteur de traitement de données rapide dédié au Big Data. Il permet d’effectuer un traitement de larges volumes de données de manière distribuée (cluster computing). GraphX est un composant Spark pour le calcul de graphes parallèles.",
			"en":"The main objective of this project was to become familiar with Apache Spark and GraphX technologies while using the Scala language. Apache Spark is a fast data processing engine dedicated to Big Data. It allows the processing of large volumes of data in a distributed way (cluster computing). GraphX is a component in Spark for graphs and graph-parallel computation."
        },
        "CC_project": {
            "fr":"Projet",
			"en":"Project"
        },
        "CC_project_desc": {
            "fr":"Le programme simule un champ de bataille entre deux équipes. Il gère un graphe (GraphX) contenant tous les protagonistes du combat ainsi que leurs relations (ami ou ennemi). À chaque tour de combat, le programme met à jour le graphe (déplacements, cibles, dégâts, etc.) jusqu’à atteindre la fin du combat. Le programme transmet en temps réel les données de chaque tour en WebSocket. Nous avons créé une interface graphique qui reçoit ces données pour afficher l’état du graphe (<b>image 1 et 2</b>).",
			"en":"The program simulates a fight between two teams. It manages a graph (GraphX) containing all the protagonists of the fight as well as their relationships (friend or enemy). For each round of the fight, the program updates the graph (moves, targets, damage, etc.) until the end of the fight. The program broadcasts the data of each round by a WebSocket transmission. We have created a graphical interface that receives this data to display the state of the graph (<b>image 1 and 2</b>)."
        },
        "HM_context": {
            "fr":"Projet de 2 étudiants réalisé dans le cadre du cours « Programmation objet avancée » - UQAC hiver 2018",
			"en":"A 2-student project in relation with the “Advanced object programming“ course - UQAC winter 2018"
        },
        "HM_desc": {
            "fr":"Hotel Manager est une application Java simplifiée permettant la gestion d'un hôtel. Elle permet de gérer :",
			"en":"Hotel Manager is a simplified Java application for managing a hotel. It allows managing:"
        },
        "HM_desc_i1": {
            "fr":"les chambres",
			"en":"rooms"
        },
        "HM_desc_i2": {
            "fr":"les réservations",
			"en":"reservations"
        },
        "HM_desc_i3": {
            "fr":"les clients",
			"en":"clients"
        },
        "HM_desc_i4": {
            "fr":"les employés",
			"en":"employees"
        },
        "HM_desc_i5": {
            "fr":"le compte de l'employé connecté",
			"en":"the account of the connected employee"
        },
        "HM_desc2": {
            "fr":"Les deux principaux objectifs étaient de :",
			"en":"The two main objectives were to:"
        },
        "HM_desc2_i1": {
            "fr":"se familiariser avec la technologie Hibernate pour faciliter l'exploitation d'une base de données en Java (persistance des données transparente)",
			"en":"become familiar with Hibernate technology to facilitate interaction with a database in Java (transparent data persistence)"
        },
        "HM_desc2_i2": {
            "fr":"réaliser une belle interface graphique grâce à JavaFX et la librairie graphique JFoenix",
			"en":"create a beautiful graphical interface using JavaFX and the JFoenix graphic library"
        },
        "AM": {
            "fr":"« Monitoring d’activité »",
			"en":"“Activity monitoring”"
        },
        "AM_context": {
            "fr":"Projet de 2 étudiants réalisé dans le cadre de la fin d’année de Master 1 – ISEN 2017",
			"en":"A 2-student project for the first year of Master – ISEN 2017"
        },
        "AM_skill1": {
            "fr":"Base de données (MySQL)",
			"en":"Databases (MySQL)"
        },
        "AM_skill2": {
            "fr":"Technologies web standards",
			"en":"Standard web technologies"
        },
        "AM_desc": {
            "fr":"L’objectif du monitoring d’activité est de proposer une interface web permettant de visualiser l’ensemble des informations caractérisant l’activité de la personne présente dans une pièce nommée « LaboVision ». Cette pièce dispose de plusieurs capteurs. Afin de caractériser l'activité de la personne présente dans la pièce, trois indicateurs ont été développés :",
			"en":"The project consists in developing a monitoring screen showing the activity of a patient living in a medical room called “LaboVision” (which includes multiple sensors) to better understand his habits and adapt them to his pathology. Three indicators have been developed to characterize the patient’s activity:"
        },
        "AM_i1": {
            "fr":"Temps passé devant la télévision <b>(voir image 1)</b>.",
			"en":"Time spent watching TV <b>(see image 1)</b>."
        },
        "AM_i2": {
            "fr":"Présence de la personne dans les différentes parties du LaboVision : cuisine, salon, chambre <b>(voir image 2)</b>.",
			"en":"Person's location in the different parts of the “LaboVision”: kitchen, living room, bedroom <b>(see image 2)</b>."
        },
        "AM_i3": {
            "fr":"Anomalies sonores (niveau sonore anormalement élevé). L’utilisateur du monitoring peut configurer les paramètres qui caractérisent une anomalie sonore (le seuil de déclenchement, pendant combien de secondes, et sur quelle tranche horaire de la journée).",
			"en":"Sound anomalies (abnormally high sound level). A sound anomaly can be configured (trigger threshold, for how many seconds, on which time of the day)."
        },
        "AM_exe": {
            "fr":"Trois programmes, s'exécutant sur des machines présentes dans le LaboVision, permettent de générer les données de ces indicateurs. Le monitoring d’activité permet de synthétiser ces données et de les afficher via un site internet simple et intuitif <b>(voir image 3)</b>.",
			"en":"Three programs are running on machines located in the LaboVision and generating the data of their respective indicator. The monitoring screen synthesize these data and display them via a simple and intuitive website <b>(see image 3)</b>."
        },
        "RE": {
            "fr":"Robot extincteur",
			"en":"Fire extinguisher robot"
        },
        "RE_context": {
            "fr":"Projet réalisé dans le cadre du cours d’apprentissage du langage C en première année de CIR (Cycle Informatique et Réseaux) – ISEN 2014",
			"en":"Project for the first year of CIR Program – ISEN 2014"
        },
        "RE_skill1": {
            "fr":"Librairie SDL",
			"en":"SDL Library"
        },
        "RE_desc": {
            "fr":"L’objectif du projet était de créer un programme avec un affichage console et graphique d’un robot extincteur qui doit éteindre l’incendie de l’appartement dans lequel il se trouve. L’ensemble du comportement du robot était à développer et se caractérise en trois points :",
			"en":"The aim of the project was to create a program (with a console and graphic display) of a fire extinguisher robot. It needs to extinguish the fire of the apartment in which it is located. The whole behavior of the robot had to be developed and can be summarized in three points:"
        },
        "RE_o1": {
            "fr":"Connaissant la position de l’extincteur dans l’appartement, le robot utilise un algorithme de pathfinding A* pour planifier son chemin vers l’extincteur",
			"en":"Knowing the position of the fire extinguisher in the apartment, the robot uses the A* pathfinding algorithm to plan its way to the fire extinguisher"
        },
        "RE_o2": {
            "fr":"Une fois l’extincteur récupéré, le robot parcourt à l’aveugle l’intégralité de l’appartement à la recherche du feu",
			"en":"As soon as the fire extinguisher is recovered, the robot blindly searches the fire in the entire apartment"
        },
        "RE_o3": {
            "fr":"Une fois le feu trouvé, le robot adopte la meilleure stratégie possible pour subir le moins de dégâts lors de l’extinction du feu",
			"en":"Once the fire is found, the robot adopts the best possible strategy possible to undergo the least damage during the fire extinction"
        },
        "LIPS": {
            "fr":"« LIPS » - Application pour personnes âgées",
			"en":"“LIPS” - Application for elderly people"
        },
        "LIPS_context": {
            "fr":"Projet d’une dizaine d’étudiants de différentes écoles",
			"en":"Project of around ten students from different schools"
        },
        "LIPS_skill1": {
            "fr":"Développement Android",
			"en":"Android development"
        },
        "LIPS_skill2": {
            "fr":"Esprit d’innovation",
			"en":"Spirit of innovation"
        },
        "LIPS_desc": {
            "fr":"LIPS est une application sur tablette destinée aux personnes âgées. Elle propose des services classiques (mail, messagerie instantanée, photo, appel téléphonique, etc...).",
			"en":"LIPS is a Android application for the elderly people. It offers classic services (email, instant messaging, photo, phone call, etc.)."
        },
        "LIPS_desc2": {
            "fr":"Le principe du projet est de rompre l’isolement des personnes âgées avec leur famille ou leurs amis en proposant une application simplifiée pour la personne âgée. L'application est paramétrée à distance par leur famille via une interface web.",
			"en":"The aim of the project is to break the isolation of elderly people with their family or friends by offering them a simplified application. This application is managed remotely by their family via a web interface."
        },
        "LIPS_desc3": {
            "fr":"J'ai participé à ce projet en tant que développeur Android. Ce projet a participé au <b>Startup Weekend Brest</b> en janvier 2015 et a reçu le <b>prix de l'innovation sociale aux Entrepreneuriales</b> (Quimper, France).",
			"en":"I participated in this project as an Android developer. This project participated in the <b>Startup Weekend Brest</b> in January 2015 and received the <b>social innovation award at the “Entrepreneuriales” (Quimper, France)."
        },
        "FOA": {
            "fr":"Forum Ouest Avenir",
			"en":"Forum Ouest Avenir"
        },
        "FOA_context": {
            "fr":"Participation à l’organisation d’un forum partenaire avec l’ISEN Brest",
			"en":"Participation in the organization of a forum partner with ISEN Engineering school"
        },
        "FOA_skill1": {
            "fr":"Organisation",
			"en":"Organization"
        },
        "FOA_desc": {
            "fr":"Le <a class=\"text_link\" href=\"http://forumouestavenir.com/\" target=\"_blank\">Forum Ouest Avenir</a> est un moment de rencontre entre entreprises et étudiants. Ce forum est organisé par une équipe d'étudiants volontaires en provenance de différentes écoles (ISEN, l'UBO, Télécom Bretagne, France Business School ou encore ENSTA Bretagne).",
			"en":"The “Forum Ouest Avenir” is a good opportunity to bring closer companies and students. This forum is organized by a team of volunteer students from different schools (ISEN, UBO, Télécom Bretagne, France Business School or ENSTA Bretagne)."
        },
        "FOA_desc2": {
            "fr":"J'ai participé à l'organisation de l'édition 2014 au sein du pôle partenariat. J'ai eu pour principale mission de démarcher des sponsors afin de faire de la publicité pour l’événement. Cette expérience a été enrichissante, que ce soit au sein du pôle partenariat ou pour toutes les autres tâches diverses auxquelles j'ai pu contribuer le jour même du forum.",
			"en":"I participated in the organization of the 2014 edition. I joined the sponsor team. My main mission was to solicit sponsors to advertise the event. This experience has been rewarding, whether in the sponsor team or for all the other various tasks I contributed to during the day of the forum."
        }
	}
}